public class Main {
    public static void main(String[] args) {
        /**
         * Задание 1
         * При старте приложения запускаются три потока. Первый поток заполняет массив случайными числами. Два
         * других потока ожидают заполнения. Когда массив заполнен оба потока запускаются. Первый поток находит сумму
         * элементов массива, второй поток среднеарифметическое
         * значение в массиве. Полученный массив, сумма и среднеарифметическое возвращаются в метод main, где должны
         * быть отображены
         */





        /**
         * При старте приложения попросите пользователя ввести 2 дроби. Затем используя интерфейс Runnable запустить 4 потока,
         * которые используя лямбда-выражения выполнят действия:
         * Сумма двух дробей;
         * Разница двух дробей;
         * Произведение двух дробей;
         * Деление двух дробей.
         * Результ операций нужно вывести в консоль.
         */


    }
}
